InformationRegisters/омг_ЗанятоеВремяЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>омг_ЗанятоеВремяЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>омг_НомерТелефонаТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.омг_СторонниеВрачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омг_ИнтеграцияСN8N/Ext/Module.bsl
Процедура омг_ОтправкаРасписанияN8N() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = омг_ИнтеграцияСN8NПовтИсп.ПолучитьНастройки();
	
	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСN8N", "Пароль");
	
	Если Настройки.Адрес = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлены настройки интеграции с N8N";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Предупреждение, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль,,
			"Невозможно выполнить обмен с N8N. Настройки интеграции не заполнены.");
		
		Возврат;
	КонецЕсли;
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(Настройки.Адрес, 
			?(Настройки.Порт = 0, Неопределено, Настройки.Порт), 
			Настройки.Пользователь, ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()),, 60, 
			?(Настройки.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL, Неопределено));
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось установить соединение с сервером. Проверьте настройки интеграции с N8N";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль,,
			"Не удалось установить соединение с сервером. Проверьте настройки интеграции с N8N.");
		
		Возврат;
	КонецПопытки;
	
	
	ЗапросРасписание = Новый Запрос;
	ЗапросРасписание.Текст = 
	"ВЫБРАТЬ
	|	омг_ЗанятоеВремяЗаявок.Сотрудник КАК Сотрудник,
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала КАК ДатаНачала,
	|	омг_ЗанятоеВремяЗаявок.ДатаОкончания КАК ДатаОкончания,
	|	омг_ЗанятоеВремяЗаявок.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	РегистрСведений.омг_ЗанятоеВремяЗаявок КАК омг_ЗанятоеВремяЗаявок
	|ГДЕ
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала >= &НачалоТекущегоДня
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_ЗанятоеВремяЗаявок.Сотрудник,
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала,
	|	омг_ЗанятоеВремяЗаявок.ДатаОкончания,
	|	омг_ЗанятоеВремяЗаявок.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Заявки.Сотрудник КАК Сотрудник,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ ВТ_ТелеграмСотрудников
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ВТ_Заявки.Сотрудник = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое))
	|			И (КонтактнаяИнформация.Вид = &ВидКонтактнойИнформацииТелеграм)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.Сотрудник КАК Сотрудник,
	|	ВТ_Заявки.ДатаНачала КАК ДатаНачала,
	|	ВТ_Заявки.ДатаОкончания КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_ТелеграмСотрудников.Представление, """") КАК Телеграм,
	|	ВТ_Заявки.Регистратор.Клиент КАК Клиент,
	|	ЕСТЬNULL(ВТ_Заявки.Регистратор.Клиент.Представление, """") КАК КлиентПредставление,
	|	ЕСТЬNULL(ВТ_ТелеграмСотрудников.Сотрудник.Представление, """") КАК СотрудникПредставление,
	|	ЕСТЬNULL(ВТ_Заявки.Регистратор.Филиал.Наименование, """") КАК ФилиалНаименование,
	|	ЕСТЬNULL(ВТ_ТелеграмСотрудников.Сотрудник.Код, """") КАК СотрудникКод,
	|	ЕСТЬNULL(ВТ_Заявки.Регистратор.Филиал.Код, """") КАК ФилиалКод
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТелеграмСотрудников КАК ВТ_ТелеграмСотрудников
	|		ПО ВТ_Заявки.Сотрудник = ВТ_ТелеграмСотрудников.Сотрудник";
	ЗапросРасписание.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДата()));
	ЗапросРасписание.УстановитьПараметр("ВидКонтактнойИнформацииТелеграм", Настройки.ВидКонтактнойИнформацииТелеграм);
	
	РезультатРасписания = ЗапросРасписание.Выполнить();  
	ВыборкаРезультатаРасписания = РезультатРасписания.Выбрать();
	МассивДанных = Новый Массив;
	Пока ВыборкаРезультатаРасписания.Следующий() Цикл
		
		СтруктураСотрудника = Новый Структура;
		СтруктураСотрудника.Вставить("clinic", ВыборкаРезультатаРасписания.ФилиалНаименование);
		СтруктураСотрудника.Вставить("clinicCode", ВыборкаРезультатаРасписания.ФилиалКод);
		СтруктураСотрудника.Вставить("personal", ВыборкаРезультатаРасписания.СотрудникПредставление);
		СтруктураСотрудника.Вставить("personalCode", ВыборкаРезультатаРасписания.СотрудникКод);
		СтруктураСотрудника.Вставить("patient", ВыборкаРезультатаРасписания.КлиентПредставление);
		СтруктураСотрудника.Вставить("startDate", ВыборкаРезультатаРасписания.ДатаНачала);
		СтруктураСотрудника.Вставить("endDate", ВыборкаРезультатаРасписания.ДатаОкончания);
		СтруктураСотрудника.Вставить("telegramId", ВыборкаРезультатаРасписания.Телеграм);
		МассивДанных.Добавить(СтруктураСотрудника);
		
	КонецЦикла;
	ДанныеОРасписании = Новый Структура;
	ДанныеОРасписании.Вставить("schedules", МассивДанных);
	
	//Текст = ЗаписатьЗначениеJSON(Структура);
	//Структура = ПрочитатьЗначениеJSON(Текст);
	
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;               
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОРасписании);
	СтрокаДляТела = ЗаписьJSON.Закрыть();
	// Отправка
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	//передаем в заголовках размер и тип данных на отправку
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("HashServ", омг_ДополнительныеАлгоритмы.ПолучитьТекущийХэшБазы());
	//создадим заголовок запроса
	ЗапросHTTP = Новый HTTPЗапрос("/webhook/" + Настройки.ИдентификаторВебхука, ЗаголовокЗапросаHTTP);
	//загрузить строку в тело
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
	//отсылаем POST-запрос на обработку. 
	
	Попытка
		ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(ЗапросHTTP);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить данные расписания. Подробности в журнале регистрации.";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль, "Не удалось отправить данные расписания",
			ОписаниеОшибки());
	КонецПопытки;
	
	Если Не ОтветHTTP.КодСостояния = 200 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить данные расписания. Тело ответа в журнале регистрации. Код состояния: " + ОтветHTTP.КодСостояния;
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль, "Не удалось отправить данные расписания",
			ОтветHTTP.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
